{
  "IM0001": "Please fill in {{component}}",
  "IM0002": "Invalid Username or Password",
  "IM0003": "Password should be at least 8 characters",
  "IM0004": "If there is a valid account for that email address, you will receive a password reset email shortly.",
  "IM0005": "This password was compromised or is too easy to guess. Please set up another one.",
  "IM0006": "The link is invalid. Please try again.",
  "IM0007": "Please check that your passwords match and try again.",
  "IM0008": "A link to activate your account has been emailed to the address provided",
  "IM0009": "This organization invite link is no longer valid.",
  "IM0010": "Do you want to discard changes?",
  "IM0011": "Please provide a valid phone number. Phone number should contain digits only",
  "IM0012": "Please provide a valid email",
  "IM0013": "The {{component}} {{name}} would be deleted. Would you like to proceed?",
  "IM0014": "The company with the provided company name already exists.",
  "IM0015": "The provided email belongs to Squaredash superadmin. Please provide a different email.",
  "IM0016": "Please read and accept Privacy Policy and Terms of use",
  "IM0017": "The unit of measurement with the provided unit name already exists.",
  "IM0018": "Delete this {{type}}?",
  "IM0019": "{{type}} {{name}} was deleted.",
  "IM0020": "This {{object}} is not available anymore",
  "IM0021": "This unit of measurement is used in Claim items and cannot be deleted.",
  "IM0022": "The provided email is already in use. Please provide another email.",
  "IM0023": "The office with the same address already exists in your company.",
  "IM0024": "The email will be updated as soon as the user confirms their new email address.",
  "IM0025": "There are no {{component}} that match your request.",
  "IM0026": "The provided address does not exist. Please check the provided address",
  "IM0027": "{{component}} is/are not found. Please check the provided address",
  "IM0028": "{{component}} cannot be confirmed as correct. Please check the provided address",
  "IM0029": "Could you confirm that the provided value {{value}} is correct {{component}}?",
  "IM0030": "Please select the file of the following type {{types}}",
  "IM0031": "Please select the file which size is less than {{size}}",
  "IM0032": "{{user}} is the only responsible member for {{customerNumber}} customers.\nPlease select the the member the customers should be assigned to and confirm the <User name> deletion.",
  "IM0033": "You cannot delete the main location. Please mark a different location as main first.",
  "IM0034": "You account is temporarily suspended. Please contact your company owner for details.",
  "IM0035": "Claim item with the provide name already exists.",
  "IM0036": "Claim item is in use. It cannot be deleted.",
  "IM0037": "There are {{element}} assigned to {{user}}. Please reassign the documents to the new responsible person first.",
  "IM0038": "Insurance Carrier with the provided name already exists.",
  "IM0039": "Please provide a valid fax number. Fax number should contain digits only",
  "IM0040": "There are incomplete {{element}} for this insurance carrier. The insurance carrier cannot be deleted.",
  "IM0041": "There are incomplete {{element}} for {{user}}. The specialist cannot be deleted.",
  "IM0042": "There is a specialist with the same email in this insurance company",
  "IM0043": "There are Claim items with the same name added by company(ies) ${company}. Do you want to merge all the items and add them to the global list of Claim items?",
  "IM0044": "The customer {{customer}} cannot be added as a parent customer. This customer is marked as a sub-customer.",
  "IM0044-1": "If Sub-customer checkbox selected sub-customer should be chosen.",
  "IM0045": "There is a customer with the provided phone number. Please provide another phone number",
  "IM0046": "Customer with provided display name already exist. Please provide another display name",
  "IM0047": "You have no permissions to change the customer details. Please contact your company owner.",
  "IM0048": "There is(are) incomplete jobs assigned to {{customer}}. The customer cannot be deleted",
  "IM0049": "Wrong password",
  "IM0050": "We have send you an email with a code to confirm that you own the email address {{email}}. Please check your inbox for {{email}} and enter the code from the email below.",
  "IM0051": "The code is invalid",
  "IM0052": "The password has been updated",
  "IM0053": "The {{object}} not found.",
  "IM0054": "This action is not available",
  "IM0056": "The {{object}} with the provided name already exists.",
  "IM0057": "There is an insurance scope with claim number {{claimNumber}} for {{insuranceCarrier}}. Do you want to upload a new version of the insurance scope?",
  "IM0058": "Please set up due date as an integer number of days",
  "IM0059": "The text was too long. The text was cut off",
  "IM0060": "The provided value should be a positive numeric with 2 decimal signs",
  "IM0061": "The date should be provided in the following format: MM/DD/YYYY.",
  "IM0062": "Future dates are not accepted.",
  "IM0063": "There is no customer with such display name. You can save a new customer or select the existing customer manually from the list of customers.",
  "IM0064": "The following {{attributeName}} is saved for this customer: {{attributeValue}}. Do you want to use the existing {{attributeName}}?",
  "IM0065": "The following {{attributeName}} is saved for this customer: {{attributeValue}}. Do you want to use the existing {{attributeName}}?",
  "IM0066": "Invalid address",
  "IM0067": "There is no insurance carrier with such a name. Please select the existing insurance carrier manually from the list of insurance carriers. If the required carrier does not exist please contact SquareDash support team.",
  "IM0068": "The following {{attributeName}} is saved for this insurance carrier: {{attributeValue}}. Do you want to use the existing {{attributeName}}?",
  "IM0069": "Do you want to delete a group and all the line items included in the group?",
  "IM0070": "Customer {{customer}} has different {{fields}} saved in the system. Do you want to update customer’s data?",
  "IM0071": "Index should be an integer",
  "IM0072": "There is no claim item with such a name in the list of claim items.  Do you want to add a new claim item?",
  "IM0073": "The provided unit of measurement does not exist. Please select an existing unit of measurement.",
  "IM0074": "The current value does not match the one from the document. Please check the original document.",
  "IM0075": "Please correct all the found errors before marking the insurance scope as verified.",
  "common": "Something went wrong. Please try later",
  "fill_form": "Please complete all required fields."
}
